acdbOpenObject(AcDbObject**!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcDbObjectId,=FUNC:AcRxClass*,AcDb.OpenMode,System.Boolean)
This function opens an AcDbObject for read, write or notify access
pObj:  A reference to a pointer to the Object. Set to null on errors
id:  The id of the object to open.
pfDesc:  Pointer to an AcRxClass's static desc method
mode:  Whether to open the object for read, write or notify access
openErased:  If true, then open the object even when it is erased
Returns:  Returns Acad::eOk if the object is opened successfully, otherwise an error code.
Remarks:  This is the worker function for the acdbOpenObject template func.
Returns Acad::eNullPtr error if pfDesc is null.